def area(a, b):
    """
    Вычисляет площадь прямоугольника.

    Параметры:
    a (float): Длина одной стороны прямоугольника.
    b (float): Длина второй стороны прямоугольника.

    Возвращает:
    float: Площадь прямоугольника.
    """
    return a * b

def perimeter(a, b):
    """
    Вычисляет периметр прямоугольника.

    Параметры:
    a (float): Длина одной стороны прямоугольника.
    b (float): Длина второй стороны прямоугольника.

    Возвращает:
    float: Периметр прямоугольника.
    """
    return 2 * (a + b)
