def area(a, h):
    """
    Вычисляет площадь треугольника.

    Параметры:
    a (float): Длина основания треугольника.
    h (float): Высота треугольника.

    Возвращает:
    float: Площадь треугольника.
    """
    return a * h / 2

def perimeter(a, b, c):
    """
    Вычисляет периметр треугольника.

    Параметры:
    a (float): Длина стороны A треугольника.
    b (float): Длина стороны B треугольника.
    c (float): Длина стороны C треугольника.

    Возвращает:
    float: Периметр треугольника.
    """
    return a + b + c
